package com.example.customertextview.ui;

import android.content.Context;
import android.graphics.Bitmap;
import androidx.appcompat.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;

import com.example.customertextview.R;
import com.example.customertextview.view.ShotScreenView;

public class ScreenViewActivity extends AppCompatActivity implements View.OnClickListener {

    private Button mBtn;
    private ImageView mShotScreenImageView;

    private static final String mContent = "混合插入有序数组，由于两个数组都是有序的，所有只要按顺序比较大小即可。" +
            "最先想到的方法是建立一个m+n大小的新数组，然后逐个从A和B数组中取出元素比较，把较小的加入新数组，然后在考" +
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"+
            "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            + "虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里"
            +" 虑A数组有剩余和B数组有剩余的两种情况，最后在把新数组的元素重新赋值到A数组中即可作者：公众号_程序员乔戈里";

    private static final String url = "https://www.baidu.com";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_screen_view);
        mBtn = findViewById(R.id.btn);
        mShotScreenImageView = findViewById(R.id.shot_screen_view);
        mBtn.setOnClickListener(this);
    }

    @Override
    public void onClick(View v) {
        if (v.getId() == R.id.btn) {
            ShotScreenView shotScreenView = new ShotScreenView(this);
            Bitmap bitmap = shotScreenView.shareBitmapWithQrCode(mContent, url, dip2px(ScreenViewActivity.this, 61));
            mShotScreenImageView.setImageBitmap(bitmap);
        }
    }

    /**
     * dp2px
     */
    public static int dip2px(Context context, float dpValue) {
        final float scale = context.getResources().getDisplayMetrics().density;
        return (int) (dpValue * scale + 0.5f);
    }
}
